app/controllers/guesses_controller.rb

    def show_all
        @guess = Guess.all
---
SELECT  "guesses".* FROM "guesses" ORDER BY "guesses"."id" ASC LIMIT ?  [["LIMIT", 1]]