app/controllers/guesses_controller.rb

INSERT INTO "guesses" ("program", "previous_job", "previous_city", "hometown", "undergrad", "name", "add_info", "created_at", "updated_at", "partner") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def save_new_info
    @guess = Guess.new

    @guess.name = params.fetch("name")
    @guess.program = params.fetch("program")
    @guess.previous_job = params.fetch("previous_job")
    @guess.previous_city = params.fetch("previous_city")
    @guess.hometown = params.fetch("hometown")
    @guess.partner = params.fetch("partner")
    @guess.undergrad = params.fetch("undergrad")
    @guess.add_info = params.fetch("add_info")

    @guess.save

SELECT  "guesses".* FROM "guesses" WHERE (name='MalortMike') ORDER BY "guesses"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
    def show
        @guess = Guess.find(params[:id])